package zhw.execute;

public class CouponMain {
    public static void main(String[] args){
//        1张券
//            进入结算页，在结算页让券失效
//                点击提交订单：报错（优惠券状态发生变化）
//                进入优惠券列表页
//                    不展示优惠券
//                    点击立享优惠：返回结算页
//                        点击提交订单：成功
//                    点击原价购买：返回结算页
//                        点击提交订单：成功
//            进入麦德龙优惠券列表页，在优惠券列表页让券失效
//                点击立享优惠：返回结算页，报错（优惠券状态发生变化），重新挂券
//                    点击提交订单：成功
//                点击原价购买：返回结算页
//                    点击提交订单：成功
//        2张券
//            进入结算页，让其中1张券失效
//                点击提交订单：报错（优惠券状态发生变化）
//                进入优惠券列表页
//                    展示1张优惠券
//                    点击立享优惠：返回结算页
//                        点击提交订单：成功
//                    点击原价购买：返回结算页
//                        点击提交订单：成功
//            进入麦德龙优惠券列表页，让其中1张券失效
//                点击立享优惠：返回结算页，报错（优惠券状态发生变化），重新挂券
//                    点击提交订单：成功
//                点击原价购买：返回结算页
//                    点击提交订单：成功
    }
}
